import 'package:techblog/gen/assets.gen.dart';
import 'package:techblog/models/data_models.dart';

Map homePagePosterMap = {
  "imageAsset": Assets.images.poster.path,
  "writer": "ملیکا عزیزی",
  "date": "یک روز پیش",
  "title": "دوازه قدم برنامه نویسی یک دوره",
  "view": "251",
};

// blog fake data

//این یعنی لیستمون از نوع هشتگ مدل هستش و اسمش تگ لیست هستش
List<HashTagModel> tagList = [
  HashTagModel(title: "جاوا"),
  HashTagModel(title: "کاتلین"),
  HashTagModel(title: "وب"),
  HashTagModel(title: "هوش مصنوعی"),
  HashTagModel(title: "iot"),
  HashTagModel(title: "دارت"),
];

List<HashTagModel> selectedTags = [];

List<BlogModel> blogList = [
  BlogModel(
    id: 1,
    imageUrl:
        "https://static.digiato.com/digiato/2025/08/WhatsApp-security-concerns-see-app-banned-in-Congress-iMessage-recommended-910x600.jpg.webp",
    title: "کارمند سابق متا درباره ضعف‌های امنیتی واتس‌اپ هشدار داد",
    writer: "حمید گنجی",
    writerImageUrl:
        "https://digiato.com/wp-content/uploads/avatars/308816-1751203566-32x32.jpg",
    date: "18 شهریور 1404 ",
    //اینجا برای این 3تا دابل کوتیشن میذاریم چون برای مقالمون که متنش زیاده ممکنه نشناسه
    content: """
یکی از کارمندان سابق متا شکایتی را علیه این شرکت به ثبت رسانده و ادعا کرده که اپلیکیشن واتس‌اپ دارای نقص‌های سیستماتیک در امنیت سایبری است که می‌تواند حریم خصوصی کاربران را به خطر بیندازد.
به گزارش CNBC، این شکایت توسط «عطاالله بیگ» (Attaullah Baig)، رئیس پیشین بخش امنیت واتس‌اپ، ثبت شده است. او مدعی است متا پس از آنکه او مشکلات امنیتی این پیام‌رسان را به مدیران، از جمله مدیرعامل مارک زاکربرگ، اطلاع داده، علیه او اقدام تلافی‌جویانه انجام داده است.
در این دادخواست گفته شده که بیگ پس از پیوستن به تیم امنیتی واتس‌اپ در سال ۲۰۲۱، نقص‌هایی را در زمینه امنیت کشف کرده که قوانین امنیتی فدرال و همچنین تعهدات حقوقی متا در ارتباط با توافق‌نامه حریم خصوصی سال ۲۰۲۰ با کمیسیون تجارت فدرال (FTC) را نقض می‌کردند.
بیگ همچنین ادعا می‌کند که ۱۵۰۰ مهندس واتس‌اپ به داده‌های کاربران، از جمله اطلاعات شخصی حساس، دسترسی نامحدود داشتند و می‌توانستند بدون اینکه قابل‌شناسایی یا رهگیری باشد، این داده‌ها را جابه‌جا یا سرقت کنند.

سخنگوی متا در بیانیه‌ای تمام این ادعاها را رد کرد و گفت که عطاالله بیگ جایگاه چندان مهمی در این شرکت نداشته است. در این بیانیه گفته شده: «متأسفانه این یک سناریوی تکراری است که در آن یک کارمند سابق به دلیل عملکرد ضعیف اخراج می‌شود و سپس با ادعاهای تحریف‌شده‌ تلاش‌های مستمر تیم ما را نادرست جلوه می‌دهد.»

عطاالله بیگ در دادخواست خود گفته که متا با استناد به ضعف عملکرد و در جریان دور دوم اخراج‌های شرکت در فوریه که ۵ درصد کارکنان را تحت‌تأثیر قرار داد، او را اخراج کرده است.

اگرچه در این دادخواست ادعایی مبنی بر افشای داده‌های کاربران آورده نشده، اما گفته شده که این کارمند سابق متا چندین بار به مافوق خود اطلاع داده بود که نقص‌های امنیت سایبری می‌تواند ریسکی برای رعایت مقررات ایجاد کند. برخی از نقص‌های امنیتی ادعاشده شامل عدم وجود مرکز عملیات امنیتی ۲۴ ساعته متناسب با اندازه و مقیاس واتس‌اپ، نبود سیستم‌های نظارت بر دسترسی به داده‌های کاربران و عدم وجود فهرست جامع از سیستم‌هایی است که داده‌های کاربران را ذخیره می‌کنند.

""",
    views: "256",
  ),
  BlogModel(
    id: 2,
    imageUrl:
        "https://static.digiato.com/digiato/2025/09/sam-altman-says-that-bots-are-making-social-media-feel-fake-%DB%B2-910x600.jpeg.webp",
    title:
        "سم آلتمن: با ازدیاد بات‌ها محتوای شبکه‌های اجتماعی غیرواقعی به‌نظر می‌رسد",
    writer: " آزاد کبیری",
    writerImageUrl:
        "https://digiato.com/wp-content/uploads/avatars/290164-32x32.jpeg",
    date: "18 شهریور 1404 ",
    //اینجا برای این 3تا دابل کوتیشن میذاریم چون برای مقالمون که متنش زیاده ممکنه نشناسه
    content: """
«سم آلتمن»، مدیرعامل شرکت OpenAI، در یک اظهارنظر تأمل‌برانگیز اعلام کرد که به دلیل گسترش بات‌ها و محتوای تولیدشده توسط هوش مصنوعی، دیگر نمی‌توان با اطمینان گفت که پست‌های موجود در شبکه‌های اجتماعی توسط انسان‌های واقعی نوشته شده‌اند و به همین دلیل جعلی به نظر می‌رسند. این نظر بسیار کنایه‌آمیز است چون از سوی مدیر شرکتی مطرح شده که خود پیشگام ساخت پیشرفته‌ترین مدل‌های زبانی برای تقلید از گفتار انسان است.


سم آلتمن در ایکس گفت درحال خواندن پستی در شبکه اجتماعی ردیت بود که احساسی به او دست داد که این محتوا توسط بات‌ نوشته شده است. او در یک ساب‌ردیت مشاهده کرد که کاربران زیادی درحال تحسین سرویس کدنویسی جدید OpenAI به نام Codex هستند. با اینکه آلتمن می‌دانست که رشد این محصول واقعی و قوی است، اما غریزه اولیه‌اش این بود که «همه این‌ها جعلی و کار ربات‌هاست.» آلتمن در ادامه پست خود، دلایل این احساس «جعلی‌بودن محتواها» در پلتفرم‌هایی مانند ردیت را تحلیل کرد.

نظرات سم آلتمن درباره محتوای بات‌ها در شبکه‌های اجتماعی
سم آلتمن می‌گوید مدتی است که نمی‌توان محتواهای انسانی را از هوش مصنوعی تشخیص داد چون مردم عادی ویژگی‌های گفتاری و سبک نوشتن مدل‌های زبانی بزرگ را به خود گرفته‌اند و ناخواسته شبیه به هوش مصنوعی می‌نویسند. همچنین کاربران بسیار فعال اینترنت تمایل دارند به شیوه‌ای هماهنگ و مشابه یکدیگر فکر و عمل کنند، که باعث می‌شود نظراتشان اصالت کمتری داشته باشد. از سویی الگوریتم‌های شبکه‌های اجتماعی نیز به گونه‌ای طراحی شده‌اند که محتوای درگیرکننده را ترویج می‌دهند، که این موضوع به تولید محتوای غیرصادقانه منجر می‌شود.
البته آلتمن اعتراف کرد که چون شرکت‌های رقیب قبلاً با استفاده از حساب‌های جعلی علیه OpenAI تبلیغات منفی کرده‌اند، او اکنون به شدت نسبت به این موضوع حساس شده است و شاید وضع آنقدرها بد نباشد.

کنایه بزرگ در اظهارات آلتمن از چشم منتقدان دور نمانده است. شرکتی که هدف اصلی‌اش ساخت هوش مصنوعی برای تقلید بی‌نقص از ارتباطات انسانی است، اکنون از اینکه انسان‌ها و ربات‌ها غیرقابل تشخیص شده‌اند، گله‌مند است. علاوه‌براین، مدل‌های OpenAI بر روی حجم عظیمی از داده‌های همین شبکه‌ها، از جمله ردیت، آموزش دیده‌اند؛ پلتفرمی که خود آلتمن تا سال ۲۰۲۲ عضو هیئت‌مدیره آن بوده و یکی از سهامداران بزرگ آن است.

این وضعیت این سؤال را مطرح می‌کند که اگر اینترنت مملو از بات‌ها شده، چه کسی مقصر است؟ براساس گزارش‌ها، در سال ۲۰۲۴ بیش از نیمی از کل ترافیک اینترنت غیرانسانی بوده که بخش بزرگی از آن به دلیل فعالیت مدل‌های زبانی بزرگ است.

برخی تحلیلگران این اظهارات آلتمن را یک حرکت بازاریابی هوشمندانه برای محصول آینده این شرکت می‌دانند. شایعاتی وجود دارد که OpenAI در مراحل اولیه توسعه یک شبکه اجتماعی جدید برای رقابت با ایکس و فیسبوک قرار دارد. با ایجاد این ذهنیت که پلتفرم‌های فعلی پر از محتوای «جعلی» هستند، آلتمن ممکن است درحال آماده‌کردن زمینه برای معرفی یک شبکه اجتماعی «اصیل» و عاری از بات باشد؛ هرچند که تحقق چنین وعده‌ای در دنیای امروز بسیار دشوار به نظر می‌رسد.

""",
    views: "300",
  ),
  BlogModel(
    id: 3,
    imageUrl:
        "https://static.digiato.com/digiato/2025/09/toyota_rav4_204-910x600.jpeg.webp",
    title:
        "شرایط فروش تویوتا راو ۴ ادونچر پلاس آذریوردسال منتشر شد [شهریور ۱۴۰۴]",
    writer: "مرتضی قانع ",
    writerImageUrl:
        "https://digiato.com/wp-content/uploads/avatars/58838-32x32.jpg",
    date: "18 شهریور",
    //اینجا برای این 3تا دابل کوتیشن میذاریم چون برای مقالمون که متنش زیاده ممکنه نشناسه
    content: """
شرکت آذیوردسال از آغاز شرایط فروش تویوتا راو ۴ ادونچر پلاس خبر داد. این خودرو برای جانبازان محترم ۵۰ درصد الی ۶۹ درصد ارائه شده است. این گروه از متقاضیان می‌توانند جهت ثبت‌نام این خودرو از طریق وب‌سایت آذریوردسال یا نمایندگی‌های مجاز این شرکت در سراسر کشور اقدام کنند.
قیمت تویوتا راو ۴ ادونچر پلاس از سوی آذریوردسال معادل سه میلیارد و ۳۱۳ میلیون تمان اعلام شده است. این خودرو در رنگ‌های سفید و مشکی و طی مدت ۵۰ روز کاری به متقاضیان تحویل داده خواهد شد. جریمه تأخیر در تحویل خودرو، ۳ درصد است که به‌صورت ماهانه محاسبه می‌شود.
این بخشنامه فاقد سود مشارکت و انصراف است. ثبت نام راو ۴ ادونچر پلاس از روز ۱۶ شهریور ۱۴۰۴ آغاز شده است. این خودرو با گارانتی سه سال یا ۶۰ هزار کیلومتر (هرکدام زودتر فرا برسد) در اختیار مشتریان قرار خواهد گرفت.
تویوتا راو ۴ ادونچر پلاس آذریوردسال به پیشرانه دو لیتری چهارسیلندر تنفس طبیعی مجهز است. این پیشرانه حداکثر ۱۷۰ اسب‌بخار قدرت و ۲۰۳ نیوتن‌متر گشتاور آزاد می‌کند. گیربکس اتوماتیک CVT نیز وظیفه انتقال قدرت را در این خودرو برعهده دارد. نسخه دولیتری تویوتا راو ۴، شتاب صفرتاصد ۹.۸ ثانیه دارد. مصرف سوخت ترکیبی این مدل نیز ۶.۹ لیتر در صد کیلومتر برآورد می‌شود.

ازجمله امکانات این خودرو می‌توان به موارد زیر اشاره کرد:

شش کیسه هوا، کروز کنترل، سیستم صوتی به همراه نمایشگر لمسی، دوربین و سنسور پارک عقب، سیستم تهویه مطبوع اتوماتیک دو کاناله، حالات مختلف رانندگی، رینگ‌های آلیاژی و چراغ‌های LED .
درحال‌حاضر تویوتا راو ۴ تک‌دیفرانسیل با قیمت تقریبی شش میلیارد و ۵۰۰ میلیون تومان در بازار آزاد به فروش می‌رسد. تویوتا راو ۴ دو دیفرانسیل نیز هفت میلیارد و ۵۰۰ میلیون تومان قیمت دارد.
""",
    views: "246",
  ),
  BlogModel(
    id: 4,
    imageUrl:
        "https://static.digiato.com/digiato/2025/09/aoc-q27g51f-gaming-monitor-launched-specs-price-910x600.jpeg.webp",
    title:
        "مانیتور گیمینگ 27 اینچی AOC با کیفیت 144 هرتز 2K معرفی شد؛ قیمت 105 دلار",
    writer: "مهدی فروغی",
    writerImageUrl:
        "https://digiato.com/wp-content/uploads/avatars/353341-1749323231-32x32.jpg",
    date: "18 شهریور",
    //اینجا برای این 3تا دابل کوتیشن میذاریم چون برای مقالمون که متنش زیاده ممکنه نشناسه
    content: """
شرکت AOC به‌تازگی یک مانیتور گیمینگ 27 اینچی با مدل Q27G51F را در بازار چین معرفی کرده است. این مانیتور با قیمت 749 یوان (حدود 105 دلار) عرضه شده و هم‌اکنون از طریق JD.com قابل خریداری است. در ادامه به مشخصات مهم و قابلیت‌های کلیدی این مانیتور می‌پردازیم.
مشخصات مانیتور AOC Q27G51F
طبق گزارش‌ها، مانیتور Q27G51F دارای پنل Fast IPS با رزولوشن 2560×1440 پیکسل است و نرخ تازه‌سازی 144 هرتز را به‌صورت بومی ارائه می‌دهد تا تجربه‌ای روان و بدون لگ در بازی‌های سرعتی فراهم شود. زمان پاسخ‌دهی 0.5 میلی‌ثانیه MPRT و 4 میلی‌ثانیه GtG است که باعث کاهش تاری حرکتی و اثر شبح در صحنه‌های سریع می‌شود.
این مانیتور مجهز به فناوری اختصاصی MBR Sync است که با اضافه کردن فریم‌های سیاه بین فریم‌های اصلی و هماهنگی با نرخ تازه‌سازی، وضوح حرکتی را افزایش می‌دهد و روشنایی یکنواخت تصویر را حفظ می‌کند.

از نظر عملکرد رنگ، Q27G51F پوشش 99 درصدی sRGB و 90 درصدی DCI-P3 را ارائه می‌دهد و از عمق رنگ 8 بیتی و کالیبراسیون کارخانه‌ای با Delta E کمتر از 2 برای sRGB بهره‌مند است که رنگ‌های طبیعی و دقیق نمایش می‌دهد. این پنل همچنین از HDR10 پشتیبانی می‌کند، روشنایی معمول 300 نیت دارد و نسبت کنتراست استاتیک 1500:1 ارائه می‌دهد.

برای محافظت از چشم، مانیتور دارای فیلتر سخت‌افزاری نور آبی، DC dimming برای تصاویر بدون پرش و چهار حالت پیش‌فرض کاهش نور آبی برای استفاده‌های مختلف مانند مطالعه، کار اداری یا تماشای ویدیو است. علاوه‌براین، از فناوری‌های G-Sync و FreeSync پشتیبانی می‌کند تا تصاویر هنگام اتصال به کارت‌های گرافیک سازگار بدون پارگی نمایش داده شوند.

در بخش اتصالات، مانیتور شامل HDMI 2.0 ،DisplayPort 1.4 و خروجی صوتی 3.5 میلی‌متری است. پایه مانیتور قابلیت تنظیم شیب از -5 درجه تا 23 درجه دارد و با پایه‌های دیواری VESA 100×100 میلی‌متری سازگار است. وزن کل همراه با پایه 3.23 کیلوگرم بوده و در بسته‌بندی مقوایی دوستدار محیط‌زیست عرضه می‌شود.

برای گیمرها، Q27G51F امکاناتی مانند تنظیم رنگ بازی (GameColor)، کاهش تأخیر ورودی و پروفایل‌های قابل سفارشی‌سازی از طریق نرم‌افزار AOC G-Menu ارائه می‌دهد. AOC اعلام کرده که هر واحد مانیتور پیش از ارسال کالیبره شده و طراحی آن با همکاری تیم‌های eSports صورت گرفته است.
""",
    views: "386",
  ),
  BlogModel(
    id: 5,
    imageUrl:
        "https://static.digiato.com/digiato/2025/09/xiaomi-recalls-over-a-hundred-thousand-power-banks-910x600.jpg.webp",
    title:
        "شیائومی بیش از صد هزار پاوربانک را به‌دلیل مشکلات ایمنی جمع‌آوری می‌کند",
    writer: "مهدی فروغی",
    writerImageUrl:
        "https://digiato.com/wp-content/uploads/avatars/353341-1749323231-32x32.jpg",
    date: "17 شهریور",
    //اینجا برای این 3تا دابل کوتیشن میذاریم چون برای مقالمون که متنش زیاده ممکنه نشناسه
    content: """
شرکت شیائومی اعلام کرده است که برخی از پاوربانک‌های 33 وات 20 هزار میلی‌آمپرساعتی خود را به‌دلیل مشکلات احتمالی ایمنی و گرمای بیش از حد جمع‌آوری می‌کند.
طبق گزارش‌ها، این اقدام تنها شامل دستگاه‌های محدودی می‌شود که بین آگوست و سپتامبر 2024 تولید شده‌اند. کاربران می‌توانند با مراجعه به صفحه پشتیبانی رسمی شیائومی بررسی کنند که آیا پاوربانک آنها تحت این برنامه جمع‌آوری قرار دارد یا خیر.

محصولات جانبی شیائومی مانند پاوربانک‌ها و هدفون‌های بی‌سیم این شرکت محبوبیت بالایی دارند و اغلب خریداران با بودجه محدود آنها را انتخاب می‌کنند. اخیراً شیائومی پس از شناسایی یک مشکل ایمنی بالقوه، تصمیم به فراخوانی پاوربانک‌های 20 هزارمیلی‌آمپرساعتی خود گرفته است.

جمع‌آوری بیش از صد هزار پاوربانک شیائومی
در بیانیه رسمی این شرکت آمده است که این جمع‌آوری شامل مدل PB2030MI با ظرفیت 20 هزارمیلی‌آمپرساعتی و توان 33 واتی است. این پاوربانک‌ها دارای کابل شارژ سرخود هستند و این ویژگی می‌تواند به شناسایی دستگاه‌های مشمول طرح جمع‌آوری کمک کند. دو رنگ آبی و بژ این مدل‌ها در طرح جمع‌آوری قرار دارند. سایر مدل‌های پاوربانک شیائومی امن هستند و کاربران می‌توانند بدون نگرانی از آنها استفاده کنند.
شیائومی اعلام کرده است که با وجود کم بودن تعداد موارد گزارش‌شده از این مشکل، ایمنی کاربران و تضمین کیفیت محصولات همچنان در اولویت اصلی آنها قرار دارد و بابت هرگونه ناراحتی یا دردسر ایجادشده از کاربران عذرخواهی کردند.

علت اصلی این مشکل ایمنی به تأمین‌کننده مواد اولیه بازمی‌گردد. طبق اعلام این شرکت، برخی مواد خام خاص در فرایند تولید باعث این مشکل شده و تنها تعداد محدودی از دستگاه‌های فروخته شده در سطح جهانی تحت تأثیر قرار گرفته‌اند.

کاربرانی که این مدل پاوربانک را دارند یا مطمئن نیستند که دستگاه‌شان مشمول جمع‌آوری است، می‌توانند با مراجعه به صفحه پشتیبانی رسمی شیائومی و وارد کردن شماره سریال، وضعیت دستگاه خود را بررسی کنند. در صورت قرار داشتن دستگاه در طرح جمع‌آوری، امکان بازپرداخت یا تعویض محصول برای آنها در نظر گرفته شده است.
""",
    views: "154",
  ),
  BlogModel(
    id: 6,
    imageUrl:
        "https://static.digiato.com/digiato/2025/09/kia-k4-hatchback-1-910x600.jpg.webp",
    title:
        "کیا K4 هاچ‌بک وارد بازار می‌شود؛ محصولی جذاب و خوش‌قیمت از کره جنوبی",
    writer: "مرتضی قانع",
    writerImageUrl:
        "https://digiato.com/wp-content/uploads/avatars/58838-32x32.jpg",
    date: "17 شهریور",
    //اینجا برای این 3تا دابل کوتیشن میذاریم چون برای مقالمون که متنش زیاده ممکنه نشناسه
    content: """
کیا پس از معرفی مدل جدید K4 که در واقع جایگزین سراتو است، اکنون نسخه هاچ‌بک آن را نیز معرفی کرده است. کیا K4 هاچ‌بک نخستین بار در مکزیک فعالیت خود را آغاز کرد و به‌زودی در ایالات‌متحده، کانادا و خاورمیانه نیز عرضه خواهد شد. این مدل در سال آینده به بازار اروپا نیز راه خواهد یافت و احتمالاً نام کیا سید (Ceed) برای آن انتخاب خواهد شد.
عرضه کیا K4 از سال گذشته به‌عنوان یک خودرو سدان آغاز شد. کیا K4 هاچ‌بک مدتی بعد در نمایشگاه خودرو نیویورک و در ماه آوریل ۲۰۲۵ معرفی شد تا وارد بازار شود. طراحی نسخه هاچ‌بک هیچ‌گونه تفاوتی نسبت به نسخه سدان ندارد. این خودرو تنها در قالب تیپ اسپرت GT-Line با رینگ‌های ۱۸ اینچی عرضه می‌شود. مدل سدان در نسخه‌های پایه با رینگ‌های ۱۶ یا ۱۷ اینچی نیز موجود است. ابعاد کیا سراتو هاچ‌بک شامل ۴۴۴۰ میلی‌متر طول، ۱۸۵۰ میلی‌متر عرض، ۱۴۵۰ میلی‌متر ارتفاع و ۲۷۲۰ میلی‌متر فاصله محوری است.
کیا کی۴ هاچ‌بک همانند نسخه سدان، به موتور دولیتری تنفس طبیعی چهارسیلندر با تزریق غیرمستقیم سوخت (MPi) مجهز است. این پیشرانه حداکثر ۱۴۹ اسب‌بخار قدرت ارائه می‌دهد و به همراه گیربکس اتوماتیک CVT عرضه می‌شود. البته مشتریان امکان سفارش کیا سراتو هاچ‌بک با موتور ۱.۶ لیتری توربوشارژر با تزریق مستقیم سوخت (TGDi) را نیز دارند. این پیشرانه ۱۹۳ اسب‌بخار قدرت دارد و به همراه گیربکس هشت سرعته اتوماتیک معمولی ارائه می‌شود. هر دو تیپ خودرو تنها به‌صورت دیفرانسیل جلو عرضه می‌شوند.

تجهیزات کیا K4 هاچ‌بک
چراغ‌های LED، سانروف، کلاستر و نمایشگر دیجیتال ۱۲.۳ اینچی، پنل تهویه دیجیتال ۵ اینچی، شارژر بی‌سیم تلفن همراه، دوربین عقب، شش کیسه هوا، کروز کنترل تطبیقی، ترمز خودکار اضطراری و رادار نگهدارنده بین خطوط.
در تیپ بالاتر که موتور ۱.۶ لیتری توربوشارژر دارد، این خودرو به چراغ مه‌شکن LED، سیستم صوتی پرمیوم، دوربین ۳۶۰ درجه و سیستم جلوگیری برخورد از عقب مجهز خواهد بود.

قیمت کیا K4 هاچ‌بک با موتور دولیتری از ۵۲۸,۹۰۰ پزو مکزیک (۲۸,۲۶۰ دلار) آغاز می‌شود. نسخه توربوشارژر این خودرو نیز ۵۷۶,۹۰۰ پزو (۳۰,۸۲۵ دلار) قیمت دارد.
""",
    views: "321",
  ),
  // BlogModel(
  //   id: 16,
  //   imageUrl: "",
  //   title: "",
  //   writer: "",
  //   writerImageUrl: "",
  //   date: "",
  //   //اینجا برای این 3تا دابل کوتیشن میذاریم چون برای مقالمون که متنش زیاده ممکنه نشناسه
  //   content: """""",
  //   views: "256",
  // ),
];

List<PodcastModel> podcastList = [
  PodcastModel(
    id: 1,
    imageUrl: "https://assets.pippa.io/shows/63a02a3197b206001160f0e9/show-cover.jpg",
    title: """.با هر قسمت از این پادکست میخوایم شما رو توی دنیای هری پاتر غرق کنیم
""",
    writer: "تیم هری پاتر پادکست",
    writerImageUrl: Assets.images.user.path,
    count: "79",
    nameCount: 
    """
اپیزود صفر – معرفی
اپیزود اول – خیابان پریوت درایو
اپیزود دوم – پسری که زنده ماند
اپیزود سوم – تولدت مبارک
اپیزود چهارم – پیام امروز
اجرای زنده جادویی هری پاتر
اپیزود پنجم – کوچه دیاگون
اپیزود ششم – سکوی ¾9
اپیزود هفتم – آواز کلاه
اپیزود هشتم – درس معجون‌ها
""",
  ),
  PodcastModel(
    id: 2,
    imageUrl: "https://media.redcircle.com/images/2024/8/29/5/09ff0efe-b356-4b07-be1c-42675ed72762_1d66b1d9d5_1664755-1580943336450-eec0b3564a694.jpg",
    title: """می‌ترسید بی‌آنکه بداند می‌ترسد. غمگین بود بی‌آنکه بداند از چه. می‌خواست برود، بی‌آنکه بداند به کجا. دلتنگ بود، بی‌آنکه بداند برای که. _ پادکست رواق با رویکردی روانشناختی به اگزیستانسیالیسم می‌پردازه و ساده‌تر از اسمش، ریشه‌ی بسیاری از احساسات عمیق آدمی رو واکاوی می‌کنه، غمها، ترسها، آرزوها. هدف رواق کشفِ فردیِ مخاطبان از ابعادِ زیستِ اصیله و من با تکیه بر آثار اروین یالوم، در این مکاشفه همراه شما هستم""",
    writer: "فرزآن",
    writerImageUrl: Assets.images.user.path,
    count: "65",
    nameCount: 
    """
اپیزود اول: روان‌درمانی اگزیستانسیال
اپیزود دوم: ترس‌های وجودی
اپیزود سوم: هستی‌اندیشی
اپیزود چهارم: لمس نیستی
اپیزود پنجم: خُرده‌مرگ
اپیزود ششم: من دلم می‌خواد برگردم به کودکی
اپیزود هفتم: سنگر انکار
اپیزود هشتم: آخرین وسوسه‌ی مسیح
اپیزود نهم: پنهان شدن در لانه‌ی گرگ
اپیزود دهم: فرزندِ دوقطبیِ شیطان
""",
  ),
  PodcastModel(
    id: 3,
    imageUrl: "https://assets.pippa.io/shows/65417dfc6143f1001280fb90/show-cover.jpg",
    title: """خلاصه‌ی فارسی کتابهای غیرداستانی

""",
    writer: "علی بندری",
    writerImageUrl: Assets.images.user.path,
    count: "48",
    nameCount: 
    """
تاریخ ایران، قبل و بعد از اسلام
مدرسه آتن
امریکا همیشه همین شکلی بوده؟
تاریخ عراق مدرن
ژنتیک مردگان
تاریخ انگلستان از اول
سقوط شاه از نگاه وزیرش داریوش همایون
محمدعلی فروغی، رضاشاه و رویای ایران مدرن
وقتی همه اروپا فقط یک پادشاه داشت
انتخاب پاپ جدید: پشت درهای بسته واتیکان
""",
  ),
  PodcastModel(
    id: 4,
    imageUrl: "https://tehranpodcast.ir/wp-content/uploads/2020/06/rookh-400x400.jpg",
    title: """داستان زندگی کسانی که قسمتی از تاریخ ایران و جهان را رقم زدند

""",
    writer: "رخ پادکست",
    writerImageUrl: Assets.images.user.path,
    count: "32",
    nameCount: 
    """
تاریخچه فراماسونری در ایران و جهان
تاریخچه شیخیه، بابیت و بهائیت
داستان زندگی مظفرالدین شاه قسمت اول
داستان زندگی مظفرالدین شاه قسمت دوم
داستان زندگی سعدی قسمت اول
داستان زندگی سعدی قسمت دوم
داستان زندگی سعدی قسمت سوم
داستان زندگی سعدی قسمت چهارم
داستان زندگی مادر ترزا (1)
داستان زندگی مادر ترزا (2)
""",
  ),
  PodcastModel(
    id: 5,
    imageUrl: "https://image.simplecastcdn.com/images/b93fadf6-5eab-4b1a-afd2-ebad38f73291/c5349ce3-b381-4d9e-8181-cd2531d4a19b/3000x3000/show-cover.jpg?aid=rss_feed",
    title: "این کانال جدید و رسمی هاگیرواگیر است.هاگیرواگیر گفتگوی خودمانی و غیررسمی سه دوست است که هریک نظرات و افکار متفاوتی دارند. از هر دری سخنی می‌گویند و می‌خندند و موزیک گوش می‌دهند و زمان سپری می‌کنند. گاه حرف‌هایی مهم و جدی می‌زنند گاه مخالفت‌هایشان با هم تا سرحد سکوت و قهر کردن می‌رسد گاه همنظر و همدل می‌شوند ولی در هرحال یاد گرفته‌اند صبور باشند و مدارا کنند و حرف دیگری را بشنوند.شمای شنونده هم نفر چهارم این جمع هستید. این سه نفراز نخستین روزهای عالمگیری کرونا و قرنطینه‌شان در ایام نوروز پادکست را شروع کرده‌ ",
    writer: "تیم هاگیرواگیر",
    writerImageUrl: Assets.images.user.path,
    count: "20",
    nameCount: 
    """
ماچ‌ها !
فرستنده: ایران
انرژی زنانه
آتش‌بس
افترپارتی
تصویر ایرانی
من_دیگه‌ها

""",
  ),
];
